PGML-BL/OpenFoam_Laminar/laminarFlatPlate/pinn_paper_mesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices        
(
    (0 0 0)    //0
    (100 0 0)   //1
    (100 20 0)  //2
    (0 20 0)   //3
    (0 0 1)    //4
    (100 0 1)   //5
    (100 20 1)  //6
    (0 20 1)   //7
    (0 60 0)  //8
    (100 60 0) //9
    (0 60 1)  //10
    (100 60 1) //11
    (-20 0 0)  //12
    (-20 0 1)  //13
    (-20 20 0) //14
    (-20 20 1) //15
    (-20 60 0) //16
    (-20 60 1)	//17
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (100 60 1) simpleGrading (6 10 1)
    hex (3 2 9 8 7 6 11 10) (100 30 1) simpleGrading (6 3 1)
    hex (12 0 3 14 13 4 7 15) (20 60 1) simpleGrading (.1 10 1)
    hex (14 3 8 16 15 7 10 17) (20 30 1) simpleGrading (.1 3 1)
);

edges           
(
);

patches         
(
    wall top
    (
        (8 9 11 10)
	(16 8 10 17)
    )
    wall inlet
    (
        (14 16 17 15)
	(12 14 15 13)
    )
    wall outlet
    (
        (9 2 6 11)
	(2 1 5 6)
    )
    wall plate
    (
       
	(0 4 5 1)

    )
    wall symmBound
    (
	(12 13 4 0)
    )
    empty frontAndBack 
    (
        (3 0 1 2)
        (7 6 5 4)
	(8 3 2 9)
	(10 11 6 7)
	(14 12 0 3)
	(15 7 4 13)
	(16 14 3 8)
	(17 10 7 15)
    )
);

mergePatchPairs 
(
);
// ************************************************************************* //
